[
  {
    "id": "1",
    "title": "What are healthy cooking oils?",
    "content": "Olive oil, avocado oil, and canola oil are considered heart-healthy. Coconut oil is good for high-heat cooking but should be used in moderation due to saturated fat."
  },
  {
    "id": "2",
    "title": "How many calories are in a boiled egg?",
    "content": "A single boiled egg contains about 70–78 calories and is a good source of protein, vitamins, and healthy fats."
  },
  {
    "id": "3",
    "title": "Vegan protein sources",
    "content": "Vegan diets can include protein from lentils, chickpeas, tofu, tempeh, seitan, quinoa, chia seeds, and almonds."
  },
  {
    "id": "4",
    "title": "Quick Breakfast Ideas",
    "content": "Overnight oats, smoothies, Greek yogurt with fruits, boiled eggs with toast, and peanut butter banana wraps are all healthy and quick breakfast options."
  },
  {
    "id": "5",
    "title": "Is brown rice healthier than white rice?",
    "content": "Yes, brown rice retains the bran and germ, making it richer in fiber, vitamins, and minerals than white rice."
  },
  {
    "id": "6",
    "title": "What is the glycemic index of foods?",
    "content": "The glycemic index (GI) ranks carbohydrates based on how they affect blood sugar levels. Low-GI foods (like oats, lentils, and non-starchy vegetables) are better for blood sugar control."
  },
  {
    "id": "7",
    "title": "Low-carb meal options",
    "content": "Zucchini noodles, cauliflower rice, grilled chicken salad, and egg muffins are great low-carb meals."
  },
  {
    "id": "8",
    "title": "What is intermittent fasting?",
    "content": "Intermittent fasting is an eating pattern where you cycle between periods of eating and fasting, such as 16:8 (16 hours fasting, 8 hours eating)."
  },
  {
    "id": "9",
    "title": "What are good sources of protein?",
    "content": "Good sources of protein include lean meats, poultry, fish, eggs, dairy products, legumes like lentils and beans, tofu, tempeh, nuts, and seeds."
  },
  {
    "id": "10",
    "title": "How much protein do I need daily?",
    "content": "The average adult needs about 0.8 grams of protein per kilogram of body weight per day. Active individuals or athletes may need up to 1.2–2.0 grams per kilogram."
  },
  {
    "id": "11",
    "title": "What are vegetarian sources of protein?",
    "content": "Vegetarian protein sources include paneer, lentils, chickpeas, quinoa, Greek yogurt, milk, soy milk, tofu, almonds, peanuts, chia seeds, and oats."
  },
  {
    "id": "12",
    "title": "Is it safe to consume protein powder?",
    "content": "Protein powders are generally safe in moderate amounts, especially for athletes or those who have higher protein needs. Always choose high-quality products and consult a nutritionist if unsure."
  },
  {
    "id": "13",
    "title": "What is complete protein?",
    "content": "A complete protein contains all nine essential amino acids. Examples include eggs, meat, fish, dairy, quinoa, soy products like tofu, and buckwheat."
  },
  {
    "id": "14",
    "title": "Can I get enough protein from a vegan diet?",
    "content": "Yes, a well-planned vegan diet can meet all protein needs using foods like lentils, chickpeas, tofu, tempeh, soy milk, quinoa, nuts, seeds, and protein-rich vegetables."
  },
  {
    "id": "15",
    "title": "High-protein breakfast ideas",
    "content": "Try Greek yogurt with nuts, eggs on whole-grain toast, peanut butter banana wrap, protein smoothie, or a chickpea salad sandwich."
  },
  {
    "id": "16",
    "title": "How does protein help the body?",
    "content": "Protein supports muscle repair, immune function, hormone production, skin health, and enzyme activity. It's a key macronutrient for overall body function."
  },
  {
    "id": "17",
    "title": "Can too much protein be harmful?",
    "content": "Excessive protein intake over time may strain the kidneys, especially in those with pre-existing conditions. It can also lead to dehydration and digestive issues if not balanced with fiber and fluids."
  },
  {
    "id": "18",
    "title": "Protein content of common foods",
    "content": "1 egg = 6g, 100g chicken breast = 31g, 1 cup cooked lentils = 18g, 100g paneer = 18g, 1 scoop whey protein = ~20–25g, 1 cup milk = 8g."
  },
  {
    "id": "19",
    "title": "Does protein help with weight loss?",
    "content": "Yes, protein can aid in weight loss by increasing satiety, reducing cravings, and preserving muscle mass during calorie deficits. It also boosts metabolism slightly through the thermic effect of food."
  },
  {
    "id": "20",
    "title": "When should I consume protein for muscle gain?",
    "content": "For muscle gain, consume protein throughout the day and especially after workouts. Aim for 20–30g of high-quality protein within 30–60 minutes post-exercise."
  },
  {
    "id": "21",
    "title": "What are slow-digesting vs fast-digesting proteins?",
    "content": "Fast-digesting proteins like whey are ideal post-workout for quick absorption. Slow-digesting proteins like casein are better before bed as they release amino acids gradually over time."
  },
  {
    "id": "22",
    "title": "How does protein affect blood sugar?",
    "content": "Protein has a minimal effect on blood sugar levels and may even help stabilize them when consumed with carbs, making it beneficial for people with diabetes."
  },
  {
    "id": "23",
    "title": "What are signs of protein deficiency?",
    "content": "Signs include muscle loss, fatigue, hair thinning, brittle nails, weakened immunity, and slow wound healing. Severe deficiency can lead to kwashiorkor, especially in children."
  },
  {
    "id": "24",
    "title": "Best protein-rich Indian vegetarian meals",
    "content": "Rajma-chawal, chole-chawal, dal with quinoa, palak paneer, moong dal chilla, besan cheela, soya chunks curry, and sprout salad are all rich in protein."
  },
  {
    "id": "25",
    "title": "Protein myths debunked",
    "content": "Myth: Eating too much protein damages kidneys in healthy individuals. Fact: This is mostly untrue unless there's a pre-existing condition. Also, plant protein can be complete when combined properly."
  },
  {
    "id": "26",
    "title": "High-Protein Chickpea Salad",
    "content": "This salad includes boiled chickpeas, cucumber, tomato, onion, lemon juice, and black salt. It's rich in plant protein, fiber, and makes a great mid-day meal."
  },
  {
    "id": "27",
    "title": "Soya Chunks Curry",
    "content": "Made using soya chunks, onion, tomato, and Indian spices. Soya is one of the richest plant-based protein sources, perfect for vegetarians aiming to build muscle."
  },
  {
    "id": "28",
    "title": "Moong Dal Chilla",
    "content": "A savory pancake made from soaked moong dal, green chilies, ginger, and veggies. It’s high in protein and a great breakfast option."
  },
  {
    "id": "29",
    "title": "Paneer Bhurji",
    "content": "Scrambled paneer cooked with onion, tomato, turmeric, and spices. Great for breakfast or lunch, especially if you're looking for dairy-based protein."
  },
  {
    "id": "30",
    "title": "Quinoa & Rajma Bowl",
    "content": "A power bowl with boiled quinoa, kidney beans (rajma), bell peppers, and light seasoning. A complete protein combo ideal for lunch."
  },
  {
    "id": "31",
    "title": "Sprouted Moong Salad",
    "content": "Sprouted moong with onion, tomato, lemon, and chat masala. Easy to digest and protein-rich."
  },
  {
    "id": "32",
    "title": "Grilled Chicken with Quinoa & Veggies",
    "content": "Marinated chicken breasts grilled and served with boiled quinoa and steamed vegetables. Rich in lean protein, fiber, and ideal for bulk meal prep."
  },
  {
    "id": "33",
    "title": "Tofu Stir Fry with Brown Rice",
    "content": "Tofu cubes sautéed with bell peppers, broccoli, soy sauce, and sesame oil. Served with brown rice. High in plant protein and perfect for 3–4 meals."
  },
  {
    "id": "34",
    "title": "Chickpea & Spinach Curry",
    "content": "Protein-packed curry made from boiled chickpeas, tomatoes, onions, and spinach. Stores well for up to 3 days. Serve with rice or roti."
  },
  {
    "id": "35",
    "title": "Soya Masala Wraps",
    "content": "Spiced soya granules with onion and tomato, rolled in whole wheat wraps. Can be refrigerated and reheated. High in protein and great for lunch boxes."
  },
  {
    "id": "36",
    "title": "Grilled Paneer & Vegetable Skewers",
    "content": "Paneer cubes and bell peppers grilled on skewers with herbs and lemon juice. Keeps well in the fridge and provides a protein-dense snack or side."
  },
  {
    "id": "37",
    "title": "Rajma Quinoa Meal Box",
    "content": "Cooked kidney beans (rajma) in tomato masala served with boiled quinoa. A complete protein option, suitable for weekly meal prepping."
  },
  {
    "id": "38",
    "title": "Best protein bars for post-workout",
    "content": "Look for bars with 15–25g protein, low sugar, and minimal additives. Brands like MyProtein, Quest, or homemade bars with oats, nut butter, and whey work well."
  },
  {
    "id": "39",
    "title": "What is the thermic effect of protein?",
    "content": "Protein has a high thermic effect (20–30%), meaning your body uses more energy to digest it compared to fats (0–3%) and carbs (5–10%)."
  },
  {
    "id": "40",
    "title": "What is casein protein?",
    "content": "Casein is a slow-digesting dairy protein often consumed before bed to prevent muscle breakdown overnight. Found in cottage cheese and milk."
  }
]



		  

		

  
